NIC/sixthDay.org
#+DATE: 2024-01-03 Wed
#+AUTHOR: GCES Linux Community
#+TITLE: Day 10
#+HOURS: 2 hour
#+CREATOR: GCES Linux Community
#+LANGUAGE: en


* Firewalld
=Firewalld is a dynamically managed firewall solution for Linux systems that provides a high-level interface for managing firewall rules. It is designed to be more user-friendly and flexible than traditional static firewall configurations.=
** Zone
A zone is a predefined set of rules that specify the level of trust for a network or interface. Each zone has its own set of rules for incoming and outgoing traffic. Examples include public, work, home, internal, and external.
** Service:
A service is a predefined set of rules that define access to specific network services. For example, there are services for HTTP, HTTPS, SSH, FTP, etc. Services are associated with specific ports and protocols.
** Rich Rule:
Rich rules provide a more flexible way to define firewall rules using a syntax that allows complex conditions. Rich rules are often used for more advanced configurations beyond the capabilities of predefined services.
** Permanent vs. Runtime:
Changes to the firewall configuration can be made either permanently (persist across reboots) or at runtime (applied immediately but not persisted). The --permanent option is used for permanent changes.
** Default Zone:
The default zone is the zone assigned to network interfaces that are not explicitly configured. It determines the default behavior for incoming and outgoing traffic.
** Reload:
After making changes to the firewall configuration, the --reload command is used to apply the new settings without restarting the entire firewall.
** Masquerade:
Masquerading is a form of Network Address Translation (NAT) that allows a network to share a single public IP address. It is often used when a local network needs to access the internet through a single external IP.
** Port Forwarding:
Port forwarding allows incoming traffic on a specific port to be redirected to a different port or IP address. This can be useful for exposing services on internal networks to the outside world.
** Reject vs. Drop:
Reject sends an error message back to the source, indicating that the connection was not allowed. Drop simply discards the packet without sending any notification.
** Source and Destination:
Rules can be specified based on the source and destination addresses. Understanding how to use these parameters allows you to control traffic based on the origin or destination of packets.
** Logging:
Enabling logging for specific rules can help you monitor the firewall's activity. It allows you to see which packets are matching a particular rule.
** Interfaces:
Interfaces represent network connections on your system. You can associate specific rules or zones with specific interfaces to control traffic.
** ~Firewalld config~
*** Install
~sudo yum install firewalld~
~sudo apt install firewalld~

*** Start and enable service
~sudo systemctl start firewalld~
~sudo systemctl enable firewalld~
~sudo systemctl status firewalld~

** Basic Firewalld Config
*** List all rules
~sudo firewall-cmd --list-all~
*** Drop port 22
~sudo firewall-cmd --add-rich-rule='rule family="ipv4" service name="ssh" drop'~
*** Block ivp-4 address
~sudo firewall-cmd --add-rich-rule='rule family="ipv4" source address="<ip-addr>" drop'~
*** Note: firewalld doesn't use explicit rule indexes
*** Block All Incoming Traffic
~sudo firewall-cmd --set-default-zone=drop~
*** Flush All Rules
~sudo firewall-cmd --complete-reload~

* UFW
=ufw stands for Uncomplicated Firewall. It is a user-friendly command-line interface for managing iptables, the default firewall management tool in many Linux distributions. ufw aims to simplify the process of configuring a firewall, making it more accessible to users who may not be familiar with iptables syntax.=
** Listing Rules
   #+BEGIN_SRC shell
   sudo ufw status verbose
   #+END_SRC

