NIC/sixthDay.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-03 Wed 19:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Day 10</title>
<meta name="author" content="GCES Linux Community" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Day 10</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8cec9ef">1. Firewalld</a>
<ul>
<li><a href="#orgaaa0a4f">1.1. Zone</a></li>
<li><a href="#org61c4722">1.2. Service:</a></li>
<li><a href="#orge81dbf5">1.3. Rich Rule:</a></li>
<li><a href="#orgc66be7b">1.4. Permanent vs. Runtime:</a></li>
<li><a href="#org50b3d13">1.5. Default Zone:</a></li>
<li><a href="#orgbb695bd">1.6. Reload:</a></li>
<li><a href="#orgc959519">1.7. Masquerade:</a></li>
<li><a href="#org3154e51">1.8. Port Forwarding:</a></li>
<li><a href="#orgaaa4e41">1.9. Reject vs. Drop:</a></li>
<li><a href="#org7d15bcb">1.10. Source and Destination:</a></li>
<li><a href="#org281b191">1.11. Logging:</a></li>
<li><a href="#org625d18c">1.12. Interfaces:</a></li>
<li><a href="#org2947e8a">1.13. <code>Firewalld config</code></a>
<ul>
<li><a href="#orga04bb71">1.13.1. Install</a></li>
<li><a href="#org230f316">1.13.2. Start and enable service</a></li>
</ul>
</li>
<li><a href="#org3ecf71c">1.14. Basic Firewalld Config</a>
<ul>
<li><a href="#orgb93bf39">1.14.1. List all rules</a></li>
<li><a href="#orgca8b130">1.14.2. Drop port 22</a></li>
<li><a href="#orgb11f815">1.14.3. Block ivp-4 address</a></li>
<li><a href="#org056a606">1.14.4. Note: firewalld doesn't use explicit rule indexes</a></li>
<li><a href="#org9cb5b93">1.14.5. Block All Incoming Traffic</a></li>
<li><a href="#org9fa4028">1.14.6. Flush All Rules</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga1f9b6f">2. UFW</a>
<ul>
<li><a href="#orgf426fac">2.1. Listing Rules</a></li>
<li><a href="#orgbf80766">2.2. Block Port Number</a></li>
<li><a href="#org2a71724">2.3. Block IP Address</a></li>
<li><a href="#org41febae">2.4. Add Rule at Specific Index</a></li>
<li><a href="#org8ee7a4d">2.5. Block All Incoming Traffic</a></li>
<li><a href="#org47ac558">2.6. Flush All Rules</a></li>
<li><a href="#orgbf9b290">2.7. Save and Restore Rules</a>
<ul>
<li><a href="#org153b0af">2.7.1. Save the Rules</a></li>
<li><a href="#orgcb3ac26">2.7.2. Restore the Rules</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5a7e4b6">3. Difference between ufw,firewalld,iptables.</a></li>
<li><a href="#orgfc00f71">4. Samba Server</a>
<ul>
<li><a href="#org2b12cef">4.1. File Sharing</a>
<ul>
<li><a href="#org079c433">4.1.1. Installation and Configutaion</a></li>
</ul>
</li>
<li><a href="#org5ef8841">4.2. Printer Sharing</a></li>
<li><a href="#org544b4e7">4.3. Integration with Active Directory</a></li>
<li><a href="#orgdec20db">4.4. Cross-Platform Compatibility</a></li>
<li><a href="#orga8628ab">4.5. more&#x2026;</a></li>
</ul>
</li>
<li><a href="#orge351976">5. Simple WebServer</a></li>
</ul>
</div>
</div>


<div id="outline-container-org8cec9ef" class="outline-2">
<h2 id="org8cec9ef"><span class="section-number-2">1.</span> Firewalld</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>Firewalld is a dynamically managed firewall solution for Linux systems that provides a high-level interface for managing firewall rules. It is designed to be more user-friendly and flexible than traditional static firewall configurations.</code>
</p>
</div>
<div id="outline-container-orgaaa0a4f" class="outline-3">
<h3 id="orgaaa0a4f"><span class="section-number-3">1.1.</span> Zone</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A zone is a predefined set of rules that specify the level of trust for a network or interface. Each zone has its own set of rules for incoming and outgoing traffic. Examples include public, work, home, internal, and external.
</p>
</div>
</div>
<div id="outline-container-org61c4722" class="outline-3">
<h3 id="org61c4722"><span class="section-number-3">1.2.</span> Service:</h3>
<div class="outline-text-3" id="text-1-2">
<p>
A service is a predefined set of rules that define access to specific network services. For example, there are services for HTTP, HTTPS, SSH, FTP, etc. Services are associated with specific ports and protocols.
</p>
</div>
</div>
<div id="outline-container-orge81dbf5" class="outline-3">
<h3 id="orge81dbf5"><span class="section-number-3">1.3.</span> Rich Rule:</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Rich rules provide a more flexible way to define firewall rules using a syntax that allows complex conditions. Rich rules are often used for more advanced configurations beyond the capabilities of predefined services.
</p>
</div>
</div>
<div id="outline-container-orgc66be7b" class="outline-3">
<h3 id="orgc66be7b"><span class="section-number-3">1.4.</span> Permanent vs. Runtime:</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Changes to the firewall configuration can be made either permanently (persist across reboots) or at runtime (applied immediately but not persisted). The &#x2013;permanent option is used for permanent changes.
</p>
</div>
</div>
<div id="outline-container-org50b3d13" class="outline-3">
<h3 id="org50b3d13"><span class="section-number-3">1.5.</span> Default Zone:</h3>
<div class="outline-text-3" id="text-1-5">
<p>
The default zone is the zone assigned to network interfaces that are not explicitly configured. It determines the default behavior for incoming and outgoing traffic.
</p>
</div>
</div>
<div id="outline-container-orgbb695bd" class="outline-3">
<h3 id="orgbb695bd"><span class="section-number-3">1.6.</span> Reload:</h3>
<div class="outline-text-3" id="text-1-6">
<p>
After making changes to the firewall configuration, the &#x2013;reload command is used to apply the new settings without restarting the entire firewall.
</p>
</div>
</div>
<div id="outline-container-orgc959519" class="outline-3">
<h3 id="orgc959519"><span class="section-number-3">1.7.</span> Masquerade:</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Masquerading is a form of Network Address Translation (NAT) that allows a network to share a single public IP address. It is often used when a local network needs to access the internet through a single external IP.
</p>
</div>
</div>
<div id="outline-container-org3154e51" class="outline-3">
<h3 id="org3154e51"><span class="section-number-3">1.8.</span> Port Forwarding:</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Port forwarding allows incoming traffic on a specific port to be redirected to a different port or IP address. This can be useful for exposing services on internal networks to the outside world.
</p>
</div>
</div>
<div id="outline-container-orgaaa4e41" class="outline-3">
<h3 id="orgaaa4e41"><span class="section-number-3">1.9.</span> Reject vs. Drop:</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Reject sends an error message back to the source, indicating that the connection was not allowed. Drop simply discards the packet without sending any notification.
</p>
</div>
</div>
<div id="outline-container-org7d15bcb" class="outline-3">
<h3 id="org7d15bcb"><span class="section-number-3">1.10.</span> Source and Destination:</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Rules can be specified based on the source and destination addresses. Understanding how to use these parameters allows you to control traffic based on the origin or destination of packets.
</p>
</div>
</div>
<div id="outline-container-org281b191" class="outline-3">
<h3 id="org281b191"><span class="section-number-3">1.11.</span> Logging:</h3>
<div class="outline-text-3" id="text-1-11">
<p>
Enabling logging for specific rules can help you monitor the firewall's activity. It allows you to see which packets are matching a particular rule.
</p>
</div>
</div>
<div id="outline-container-org625d18c" class="outline-3">
<h3 id="org625d18c"><span class="section-number-3">1.12.</span> Interfaces:</h3>
<div class="outline-text-3" id="text-1-12">
<p>
Interfaces represent network connections on your system. You can associate specific rules or zones with specific interfaces to control traffic.
</p>
</div>
</div>
<div id="outline-container-org2947e8a" class="outline-3">
<h3 id="org2947e8a"><span class="section-number-3">1.13.</span> <code>Firewalld config</code></h3>
<div class="outline-text-3" id="text-1-13">
</div>
<div id="outline-container-orga04bb71" class="outline-4">
<h4 id="orga04bb71"><span class="section-number-4">1.13.1.</span> Install</h4>
<div class="outline-text-4" id="text-1-13-1">
<p>
<code>sudo yum install firewalld</code>
<code>sudo apt install firewalld</code>
</p>
</div>
</div>

<div id="outline-container-org230f316" class="outline-4">
<h4 id="org230f316"><span class="section-number-4">1.13.2.</span> Start and enable service</h4>
<div class="outline-text-4" id="text-1-13-2">
<p>
<code>sudo systemctl start firewalld</code>
<code>sudo systemctl enable firewalld</code>
<code>sudo systemctl status firewalld</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org3ecf71c" class="outline-3">
<h3 id="org3ecf71c"><span class="section-number-3">1.14.</span> Basic Firewalld Config</h3>
<div class="outline-text-3" id="text-1-14">
</div>
<div id="outline-container-orgb93bf39" class="outline-4">
<h4 id="orgb93bf39"><span class="section-number-4">1.14.1.</span> List all rules</h4>
<div class="outline-text-4" id="text-1-14-1">
<p>
<code>sudo firewall-cmd --list-all</code>
</p>
</div>
</div>
<div id="outline-container-orgca8b130" class="outline-4">
<h4 id="orgca8b130"><span class="section-number-4">1.14.2.</span> Drop port 22</h4>
<div class="outline-text-4" id="text-1-14-2">
<p>
<code>sudo firewall-cmd --add-rich-rule='rule family="ipv4" service name="ssh" drop'</code>
</p>
</div>
</div>
<div id="outline-container-orgb11f815" class="outline-4">
<h4 id="orgb11f815"><span class="section-number-4">1.14.3.</span> Block ivp-4 address</h4>
<div class="outline-text-4" id="text-1-14-3">
<p>
<code>sudo firewall-cmd --add-rich-rule='rule family="ipv4" source address="&lt;ip-addr&gt;" drop'</code>
</p>
</div>
</div>
<div id="outline-container-org056a606" class="outline-4">
<h4 id="org056a606"><span class="section-number-4">1.14.4.</span> Note: firewalld doesn't use explicit rule indexes</h4>
</div>
<div id="outline-container-org9cb5b93" class="outline-4">
<h4 id="org9cb5b93"><span class="section-number-4">1.14.5.</span> Block All Incoming Traffic</h4>
<div class="outline-text-4" id="text-1-14-5">
<p>
<code>sudo firewall-cmd --set-default-zone=drop</code>
</p>
</div>
</div>
<div id="outline-container-org9fa4028" class="outline-4">
<h4 id="org9fa4028"><span class="section-number-4">1.14.6.</span> Flush All Rules</h4>
<div class="outline-text-4" id="text-1-14-6">
<p>
<code>sudo firewall-cmd --complete-reload</code>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orga1f9b6f" class="outline-2">
<h2 id="orga1f9b6f"><span class="section-number-2">2.</span> UFW</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>ufw stands for Uncomplicated Firewall. It is a user-friendly command-line interface for managing iptables, the default firewall management tool in many Linux distributions. ufw aims to simplify the process of configuring a firewall, making it more accessible to users who may not be familiar with iptables syntax.</code>
</p>
</div>
