NIC/sixthDay.org
** Block Port Number
   #+BEGIN_SRC shell
   sudo ufw deny 22
   #+END_SRC

** Block IP Address
   #+BEGIN_SRC shell
   sudo ufw deny from <ip-addr>
   #+END_SRC
   
** Add Rule at Specific Index
   #+BEGIN_SRC shell
   sudo ufw insert 1 allow from <ip-addr> to any app OpenSSH
   #+END_SRC

** Block All Incoming Traffic
   #+BEGIN_SRC shell
   sudo ufw default deny incoming
   #+END_SRC

** Flush All Rules
   #+BEGIN_SRC shell
   sudo ufw reset
   #+END_SRC

** Save and Restore Rules
*** Save the Rules
   #+BEGIN_SRC shell
   sudo ufw status verbose > /etc/ufw/rules.v4
   #+END_SRC

*** Restore the Rules
   #+BEGIN_SRC shell
   sudo ufw --force reload
   #+END_SRC

* Difference between ufw,firewalld,iptables.

| Feature                | ufw                      | firewalld                  | iptables                                  |
|------------------------+--------------------------+----------------------------+-------------------------------------------|
| =User Interface=         | Simple and user-friendly | Command-line and GUI tools | Command-line                              |
| =Backend Tool=           | iptables                 | iptables                   | iptables                                  |
| =Zone/Profile Concept=   | No                       | Yes                        | No                                        |
| =Dynamic Rules=          | No                       | Yes                        | No                                        |
| =Rich Rules=             | No                       | Yes                        | Yes                                       |
| =Logging=                | Yes                      | Yes                        | Yes                                       |
| =Application Profiles=   | Yes                      | Yes                        | No                                        |
| =Default Policies=       | Yes                      | Yes                        | No (uses policies in chains)              |
| =Integration with Tools= | Limited                  | D-Bus interface            | iptables can integrate with various tools |
| =Distribution Support=   | Ubuntu, Debian           | Fedora, RHEL, CentOS       | Virtually all Linux distros               |

* Samba Server
=Samba is a free and open-source implementation of the Server Message Block (SMB) protocol, which is used for sharing files, printers, and other resources between computers on a network.=
** File Sharing
    Samba allows you to share files and directories between computers, regardless of their operating systems. It facilitates seamless file sharing between Windows, Linux, and macOS systems.
    Use: You can use a Samba server to create shared folders on a Linux server, making them accessible to Windows machines as if they were regular network drives.
*** Installation and Configutaion
**** Download and install
~sudo dnf install samba samba-client samba-common~
**** Enable samba through firewall
~sudo firewall-cmd --permanent --zone=public --add-service=samba~
~sudo firewall-cmd --reload~

**** Create a Directory for sharing
~sudo mkdir -p /samba/apps~
~sudo chmod 777 /samba~
~sudo chmod 777 /samba/apps~
~sudo touch /samba/apps/fileByServer~
**** Config File
~sudo mv /etc/samba/smb.conf /etc/samba/smb.conf.bak~
~sudo nano /etc/samba/smb.conf~
#+BEGIN_SRC ini
[global]
        workgroup = SAMBA
        netbios name = ubuntu
        security = user
        map to guest = bad user
        dns proxy = no
[Apps]
        comment = Samba Shared Directory
        path = /samba/apps
        browsable = yes
        writable = yes
        guest ok = yes
        guest only = yes
        read only = no
#+END_SRC
**** Test the config file
~testparm~
**** Start the Samba server
~sudo systemctl start smb nmb~
**** SMB and NMB
=SMB is a network file sharing protocol. It allows applications on a computer to read and write to files and to request services from server programs in a computer network.=

=NetBIOS is an acronym for Network Basic Input/Output System. It provides services related to the session layer of the OSI model, allowing applications on separate computers to communicate over a local area network.=
**** Client side config
***** Linux
~sudo apt install cifs-utils samba-client~
~sudo mount -t cifs //<ip-addr>/Apps /path/to/mount~
***** Windows
On Windows file manager location bar Type
~\\<ip-addr>~

** Printer Sharing
    Samba enables the sharing of printers over a network, allowing multiple users to print to a single printer connected to the Samba server.
    Use: With Samba, you can set up a centralized print server that can be accessed by various devices across different platforms.
    Link to configure: https://ubuntu.com/server/docs/samba-print-server
** Integration with Active Directory
    Definition: Samba supports integration with Microsoft Active Directory, enabling seamless collaboration between Linux/Unix systems and Windows environments.
    Use: By integrating with Active Directory, Samba allows Linux servers to participate in Windows-based networks, providing a unified authentication and authorization system.
    Link: https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/7/html/windows_integration_guide/winbind
