NIC/sixthDay.html
<div id="outline-container-orgf426fac" class="outline-3">
<h3 id="orgf426fac"><span class="section-number-3">2.1.</span> Listing Rules</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-shell">sudo ufw status verbose
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf80766" class="outline-3">
<h3 id="orgbf80766"><span class="section-number-3">2.2.</span> Block Port Number</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-shell">sudo ufw deny 22
</pre>
</div>
</div>
</div>

<div id="outline-container-org2a71724" class="outline-3">
<h3 id="org2a71724"><span class="section-number-3">2.3.</span> Block IP Address</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-shell">sudo ufw deny from &lt;ip-addr&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org41febae" class="outline-3">
<h3 id="org41febae"><span class="section-number-3">2.4.</span> Add Rule at Specific Index</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-shell">sudo ufw insert 1 allow from &lt;ip-addr&gt; to any app OpenSSH
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ee7a4d" class="outline-3">
<h3 id="org8ee7a4d"><span class="section-number-3">2.5.</span> Block All Incoming Traffic</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-shell">sudo ufw default deny incoming
</pre>
</div>
</div>
</div>

<div id="outline-container-org47ac558" class="outline-3">
<h3 id="org47ac558"><span class="section-number-3">2.6.</span> Flush All Rules</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-shell">sudo ufw reset
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf9b290" class="outline-3">
<h3 id="orgbf9b290"><span class="section-number-3">2.7.</span> Save and Restore Rules</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-org153b0af" class="outline-4">
<h4 id="org153b0af"><span class="section-number-4">2.7.1.</span> Save the Rules</h4>
<div class="outline-text-4" id="text-2-7-1">
<div class="org-src-container">
<pre class="src src-shell">sudo ufw status verbose &gt; /etc/ufw/rules.v4
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcb3ac26" class="outline-4">
<h4 id="orgcb3ac26"><span class="section-number-4">2.7.2.</span> Restore the Rules</h4>
<div class="outline-text-4" id="text-2-7-2">
<div class="org-src-container">
<pre class="src src-shell">sudo ufw --force reload
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org5a7e4b6" class="outline-2">
<h2 id="org5a7e4b6"><span class="section-number-2">3.</span> Difference between ufw,firewalld,iptables.</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">ufw</th>
<th scope="col" class="org-left">firewalld</th>
<th scope="col" class="org-left">iptables</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>User Interface</code></td>
<td class="org-left">Simple and user-friendly</td>
<td class="org-left">Command-line and GUI tools</td>
<td class="org-left">Command-line</td>
</tr>

<tr>
<td class="org-left"><code>Backend Tool</code></td>
<td class="org-left">iptables</td>
<td class="org-left">iptables</td>
<td class="org-left">iptables</td>
</tr>

<tr>
<td class="org-left"><code>Zone/Profile Concept</code></td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
</tr>

<tr>
<td class="org-left"><code>Dynamic Rules</code></td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
</tr>

<tr>
<td class="org-left"><code>Rich Rules</code></td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left"><code>Logging</code></td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left"><code>Application Profiles</code></td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
</tr>

<tr>
<td class="org-left"><code>Default Policies</code></td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-left">No (uses policies in chains)</td>
</tr>

<tr>
<td class="org-left"><code>Integration with Tools</code></td>
<td class="org-left">Limited</td>
<td class="org-left">D-Bus interface</td>
<td class="org-left">iptables can integrate with various tools</td>
</tr>

<tr>
<td class="org-left"><code>Distribution Support</code></td>
<td class="org-left">Ubuntu, Debian</td>
<td class="org-left">Fedora, RHEL, CentOS</td>
<td class="org-left">Virtually all Linux distros</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgfc00f71" class="outline-2">
<h2 id="orgfc00f71"><span class="section-number-2">4.</span> Samba Server</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>Samba is a free and open-source implementation of the Server Message Block (SMB) protocol, which is used for sharing files, printers, and other resources between computers on a network.</code>
</p>
</div>
<div id="outline-container-org2b12cef" class="outline-3">
<h3 id="org2b12cef"><span class="section-number-3">4.1.</span> File Sharing</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Samba allows you to share files and directories between computers, regardless of their operating systems. It facilitates seamless file sharing between Windows, Linux, and macOS systems.
Use: You can use a Samba server to create shared folders on a Linux server, making them accessible to Windows machines as if they were regular network drives.
</p>
</div>
<div id="outline-container-org079c433" class="outline-4">
<h4 id="org079c433"><span class="section-number-4">4.1.1.</span> Installation and Configutaion</h4>
<div class="outline-text-4" id="text-4-1-1">
</div>
<ol class="org-ol">
<li><a id="org51cf442"></a>Download and install<br />
<div class="outline-text-5" id="text-4-1-1-1">
<p>
<code>sudo dnf install samba samba-client samba-common</code>
</p>
</div>
</li>
<li><a id="orga9f8acf"></a>Enable samba through firewall<br />
<div class="outline-text-5" id="text-4-1-1-2">
<p>
<code>sudo firewall-cmd --permanent --zone=public --add-service=samba</code>
<code>sudo firewall-cmd --reload</code>
</p>
</div>
</li>

<li><a id="org999ad59"></a>Create a Directory for sharing<br />
<div class="outline-text-5" id="text-4-1-1-3">
<p>
<code>sudo mkdir -p /samba/apps</code>
<code>sudo chmod 777 /samba</code>
<code>sudo chmod 777 /samba/apps</code>
<code>sudo touch /samba/apps/fileByServer</code>
</p>
</div>
</li>
<li><a id="org9039f0b"></a>Config File<br />
<div class="outline-text-5" id="text-4-1-1-4">
<p>
<code>sudo mv /etc/samba/smb.conf /etc/samba/smb.conf.bak</code>
<code>sudo nano /etc/samba/smb.conf</code>
</p>
<div class="org-src-container">
<pre class="src src-ini">[global]
        workgroup = SAMBA
        netbios name = ubuntu
        security = user
        map to guest = bad user
        dns proxy = no
[Apps]
        comment = Samba Shared Directory
        path = /samba/apps
        browsable = yes
        writable = yes
        guest ok = yes
        guest only = yes
        read only = no
</pre>
</div>
</div>
</li>
<li><a id="org21a6a0f"></a>Test the config file<br />
<div class="outline-text-5" id="text-4-1-1-5">
<p>
<code>testparm</code>
</p>
</div>
</li>
<li><a id="org58e7fc6"></a>Start the Samba server<br />
<div class="outline-text-5" id="text-4-1-1-6">
<p>
<code>sudo systemctl start smb nmb</code>
</p>
</div>
</li>
<li><a id="orga311819"></a>SMB and NMB<br />
<div class="outline-text-5" id="text-4-1-1-7">
<p>
<code>SMB is a network file sharing protocol. It allows applications on a computer to read and write to files and to request services from server programs in a computer network.</code>
</p>

<p>
<code>NetBIOS is an acronym for Network Basic Input/Output System. It provides services related to the session layer of the OSI model, allowing applications on separate computers to communicate over a local area network.</code>
</p>
</div>
</li>
<li><a id="org4b2fc32"></a>Client side config<br />
<ol class="org-ol">
<li><a id="org61dc3b0"></a>Linux<br />
<div class="outline-text-6" id="text-4-1-1-8-1">
<p>
<code>sudo apt install cifs-utils samba-client</code>
<code>sudo mount -t cifs //&lt;ip-addr&gt;/Apps /path/to/mount</code>
</p>
</div>
</li>
<li><a id="org798d696"></a>Windows<br />
<div class="outline-text-6" id="text-4-1-1-8-2">
<p>
On Windows file manager location bar Type
<code>\\&lt;ip-addr&gt;</code>
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-org5ef8841" class="outline-3">
<h3 id="org5ef8841"><span class="section-number-3">4.2.</span> Printer Sharing</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Samba enables the sharing of printers over a network, allowing multiple users to print to a single printer connected to the Samba server.
Use: With Samba, you can set up a centralized print server that can be accessed by various devices across different platforms.
Link to configure: <a href="https://ubuntu.com/server/docs/samba-print-server">https://ubuntu.com/server/docs/samba-print-server</a>
</p>
</div>
</div>
<div id="outline-container-org544b4e7" class="outline-3">
<h3 id="org544b4e7"><span class="section-number-3">4.3.</span> Integration with Active Directory</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Definition: Samba supports integration with Microsoft Active Directory, enabling seamless collaboration between Linux/Unix systems and Windows environments.
Use: By integrating with Active Directory, Samba allows Linux servers to participate in Windows-based networks, providing a unified authentication and authorization system.
Link: <a href="https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/7/html/windows_integration_guide/winbind">https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/7/html/windows_integration_guide/winbind</a>
</p>
</div>
</div>
