NIC/sixthDay.org
** Cross-Platform Compatibility
    Definition: Samba ensures interoperability between Windows, Linux, and macOS systems by implementing the SMB protocol, allowing file and print services to be shared across different platforms.
    Use: Users can access shared resources on a Samba server using Windows Explorer, macOS Finder, or Linux file managers, fostering collaboration in heterogeneous network environments.
** more...

* Simple WebServer
~sudo apt install apache2~
~sudo dnf install httpd~
~sudo nano /var/www/index.html~
~sudo systemctl start [httpd or apache2]~
#+BEGIN_SRC html
  <!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Linux Workshop - National Innovation Center, Pokhara</title>
    <style>
        body {
            font-family: 'Segoe UI', Tahoma, Geneva, Verdana, sans-serif;
            margin: 20px;
            text-align: center;
            background-color: #f5f5f5;
            color: #333;
        }
        header {
            background-color: #3498db;
            padding: 20px;
            color: #fff;
        }
        h2 {
            color: #3498db;
        }
        section {
            margin-bottom: 30px;
            padding: 20px;
            background-color: #fff;
            border-radius: 8px;
            box-shadow: 0 0 10px rgba(0, 0, 0, 0.1);
        }
        ul {
            list-style-type: none;
            padding: 0;
        }
        li {
            padding: 8px 0;
        }
        footer {
            margin-top: 20px;
            padding: 10px;
            background-color: #3498db;
            color: #fff;
        }
        img {
            max-width: 100%;
            height: auto;
            margin-top: 20px;
            border-radius: 8px;
        }
    </style>
</head>
<body>
    <header>
        <h1>Linux Workshop</h1>
        <p>National Innovation Center, Pokhara</p>
    </header>
    <section>
        <h2>Event Details</h2>
        <p>Date: 1st Marsian Day </p>
        <p>Time: Time is relative.</p>
        <p>Location: National Innovation Center, Pokhara</p>
    </section>
    <section>
        <h2>About the Workshop</h2>
        <p>Welcome to the Linux Workshop at the National Innovation Center in Pokhara! This workshop aims to provide hands-on experience and knowledge about Linux operating systems.</p>
        <p>Topics Covered:</p>
        <ul>
            <li>Introduction to Linux</li>
            <li>Basic Commands</li>
            <li>File System Navigation</li>
            <li>Permissions and Security</li>
            <li>Practical Exercises</li>
        </ul>
    </section>
    <section>
        <h2>Speakers</h2>
        <p>Join us to hear from our distinguished speakers:</p>
        <p><strong>Bibit Kunwar Chhetri</strong></p>
        <p><strong>Satya Pr. Dahal</strong></p>
    </section>
    <section>
        <h2>Registration</h2>
        <p>To register for the workshop, please visit Mars(The Red Planet).</p>
    </section>
    <footer>
        <p>Contact us at alien@mars.planet for any inquiries.</p>
        <p>Follow us on social media: Marsbook</p>
    </footer>
</body>
</html>

#+END_SRC
