NIC/sixthDay.html
<div id="outline-container-orgdec20db" class="outline-3">
<h3 id="orgdec20db"><span class="section-number-3">4.4.</span> Cross-Platform Compatibility</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Definition: Samba ensures interoperability between Windows, Linux, and macOS systems by implementing the SMB protocol, allowing file and print services to be shared across different platforms.
Use: Users can access shared resources on a Samba server using Windows Explorer, macOS Finder, or Linux file managers, fostering collaboration in heterogeneous network environments.
</p>
</div>
</div>
<div id="outline-container-orga8628ab" class="outline-3">
<h3 id="orga8628ab"><span class="section-number-3">4.5.</span> more&#x2026;</h3>
</div>
</div>

<div id="outline-container-orge351976" class="outline-2">
<h2 id="orge351976"><span class="section-number-2">5.</span> Simple WebServer</h2>
<div class="outline-text-2" id="text-5">
<p>
<code>sudo apt install apache2</code>
<code>sudo dnf install httpd</code>
<code>sudo nano /var/www/index.html</code>
<code>sudo systemctl start [httpd or apache2]</code>
</p>
<div class="org-src-container">
<pre class="src src-html">  &lt;!DOCTYPE html&gt;
&lt;html lang="en"&gt;
&lt;head&gt;
    &lt;meta charset="UTF-8"&gt;
    &lt;meta name="viewport" content="width=device-width, initial-scale=1.0"&gt;
    &lt;title&gt;Linux Workshop - National Innovation Center, Pokhara&lt;/title&gt;
    &lt;style&gt;
        body {
            font-family: 'Segoe UI', Tahoma, Geneva, Verdana, sans-serif;
            margin: 20px;
            text-align: center;
            background-color: #f5f5f5;
            color: #333;
        }
        header {
            background-color: #3498db;
            padding: 20px;
            color: #fff;
        }
        h2 {
            color: #3498db;
        }
        section {
            margin-bottom: 30px;
            padding: 20px;
            background-color: #fff;
            border-radius: 8px;
            box-shadow: 0 0 10px rgba(0, 0, 0, 0.1);
        }
        ul {
            list-style-type: none;
            padding: 0;
        }
        li {
            padding: 8px 0;
        }
        footer {
            margin-top: 20px;
            padding: 10px;
            background-color: #3498db;
            color: #fff;
        }
        img {
            max-width: 100%;
            height: auto;
            margin-top: 20px;
            border-radius: 8px;
        }
    &lt;/style&gt;
&lt;/head&gt;
&lt;body&gt;
    &lt;header&gt;
        &lt;h1&gt;Linux Workshop&lt;/h1&gt;
        &lt;p&gt;National Innovation Center, Pokhara&lt;/p&gt;
    &lt;/header&gt;
    &lt;section&gt;
        &lt;h2&gt;Event Details&lt;/h2&gt;
        &lt;p&gt;Date: 1st Marsian Day &lt;/p&gt;
        &lt;p&gt;Time: Time is relative.&lt;/p&gt;
        &lt;p&gt;Location: National Innovation Center, Pokhara&lt;/p&gt;
    &lt;/section&gt;
    &lt;section&gt;
        &lt;h2&gt;About the Workshop&lt;/h2&gt;
        &lt;p&gt;Welcome to the Linux Workshop at the National Innovation Center in Pokhara! This workshop aims to provide hands-on experience and knowledge about Linux operating systems.&lt;/p&gt;
        &lt;p&gt;Topics Covered:&lt;/p&gt;
        &lt;ul&gt;
            &lt;li&gt;Introduction to Linux&lt;/li&gt;
            &lt;li&gt;Basic Commands&lt;/li&gt;
            &lt;li&gt;File System Navigation&lt;/li&gt;
            &lt;li&gt;Permissions and Security&lt;/li&gt;
            &lt;li&gt;Practical Exercises&lt;/li&gt;
        &lt;/ul&gt;
    &lt;/section&gt;
    &lt;section&gt;
        &lt;h2&gt;Speakers&lt;/h2&gt;
        &lt;p&gt;Join us to hear from our distinguished speakers:&lt;/p&gt;
        &lt;p&gt;&lt;strong&gt;Bibit Kunwar Chhetri&lt;/strong&gt;&lt;/p&gt;
        &lt;p&gt;&lt;strong&gt;Satya Pr. Dahal&lt;/strong&gt;&lt;/p&gt;
    &lt;/section&gt;
    &lt;section&gt;
        &lt;h2&gt;Registration&lt;/h2&gt;
        &lt;p&gt;To register for the workshop, please visit Mars(The Red Planet).&lt;/p&gt;
    &lt;/section&gt;
    &lt;footer&gt;
        &lt;p&gt;Contact us at alien@mars.planet for any inquiries.&lt;/p&gt;
        &lt;p&gt;Follow us on social media: Marsbook&lt;/p&gt;
    &lt;/footer&gt;
&lt;/body&gt;
&lt;/html&gt;

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-01-03 Wed</p>
<p class="author">Author: GCES Linux Community</p>
<p class="date">Created: 2024-01-03 Wed 19:59</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>